BusinessProcesses/БизнесПроцесс_Делопроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<BusinessProcess>
		<Properties>
			<Name>БизнесПроцесс_Делопроизводство</Name>
			<Task>Task.ЗадачаПривязкаДолжника</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Делопроизводство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Делопроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделРабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

BusinessProcesses/БизнесПроцесс_Делопроизводство/Ext/ObjectModule.bsl
Процедура ВыборВариантаЮридическаяСтадияОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	спрОтделСудебнаяСтадия=Справочники.Отделы.НайтиПоНаименованию("Судебная стадия",Истина);
	спрОтделИсполнительноеПроизводство=Справочники.Отделы.НайтиПоНаименованию("Исполнительное производство",Истина);
	спрОтделБАНКРОТСТВО=Справочники.Отделы.НайтиПоНаименованию("БАНКРОТСТВО",Истина);
	спрОтделУмершие=Справочники.Отделы.НайтиПоНаименованию("Умершие",Истина);
	спрОтделЗапросГосударственныхОрганов=Справочники.Отделы.НайтиПоНаименованию("Запрос государственных органов/физических лиц",Истина);
    спрОтделПретензионнаяРабота=Справочники.Отделы.НайтиПоНаименованию("Претензионная Работа",Истина);

	
	
	
	Если ОтделРабота=спрОтделСудебнаяСтадия  Тогда
	    Результат=ТочкаВыбораВарианта.Варианты.СудебнаяСтадия;	
	  
	КонецЕсли;
	
	Если ОтделРабота=спрОтделИсполнительноеПроизводство  Тогда
	    Результат=ТочкаВыбораВарианта.Варианты.ИсполнительноеПроизводство;	
	КонецЕсли;

	  
	
	Если ОтделРабота=спрОтделБАНКРОТСТВО  Тогда
	    Результат=ТочкаВыбораВарианта.Варианты.Банкротство;	
	КонецЕсли;

	
	Если ОтделРабота=спрОтделУмершие  Тогда
	    Результат=ТочкаВыбораВарианта.Варианты.Умершие;	
	КонецЕсли;

	
	Если ОтделРабота=спрОтделЗапросГосударственныхОрганов  Тогда
	    Результат=ТочкаВыбораВарианта.Варианты.ЗапросГосударственныхОргановФизическихЛиц;	
	КонецЕсли;

	
	Если ОтделРабота=спрОтделПретензионнаяРабота  Тогда
	    Результат=ТочкаВыбораВарианта.Варианты.ПретензионнаяРабота;	
	КонецЕсли;

	
	
КонецПроцедуры

Процедура ОтделСудебнаяСтадияПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	
	 	     СтандартнаяОбработка=Ложь;
	  		 Задача=Задачи.ЗадачаПривязкаДолжника.СоздатьЗадачу();
			 Задача.БизнесПроцесс=Ссылка;
			 Задача.ТочкаМаршрута=ТочкаМаршрутаБизнесПроцесса;
			 Задача.Дата=ТекущаяДата();
			 Задача.Наименование="БП_Судебная стадия_"+Должник+"_"+Номер;
			 Задача.Отдел=ОтделРабота;
	
	         Задача.Записать();
	         ФормируемыеЗадачи.Добавить(Задача);
			 
			 
	
КонецПроцедуры






Процедура ПроверкаКонтрольнойДатыПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	   //  сформирую задачу автоматом в Контрольнйю дату не забыть проверить эту дату при записи
	   
	   
	         СтандартнаяОбработка=Ложь;
	  		 Задача=Задачи.ЗадачаПривязкаДолжника.СоздатьЗадачу();
			 Задача.БизнесПроцесс=Ссылка;
			 Задача.ТочкаМаршрута=ТочкаМаршрутаБизнесПроцесса;
			 Задача.Дата=ТекущаяДата();
			 Задача.Наименование="БП_Судебная стадия_55555"+Должник+"_"+Номер;
			 Задача.Отдел=ОтделРабота;
			 Задача.КонтрольнаяДата=Ссылка.ДатаЗавершения;
	         Задача.Записать();
	         ФормируемыеЗадачи.Добавить(Задача);
			 
          	
	
КонецПроцедуры

Процедура ПроверкаКонтрольнойДатыПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Пошлю напоминание
	
	
	              
	
	//
	//            СрокНапоминания = НачалоДня(ТекущаяДата());
	//		    НапоминаниеТекст = "Выполнить задание  ----- ";
	//		    ПараметрыНапоминания    = Новый Структура;   
	//		    ПараметрыНапоминания.Вставить("Пользователь",спрПользователь);
	//			ПараметрыНапоминания.Вставить("ВремяСобытия"    , ТекущаяДата());
	//			ПараметрыНапоминания.Вставить("Источник"        , Ссылка);
	//			ПараметрыНапоминания.Вставить("Описание"        , НапоминаниеТекст);
	//			ПараметрыНапоминания.Вставить("СрокНапоминания", СрокНапоминания);
	//			ПараметрыНапоминания.Вставить("СпособУстановкиВремениНапоминания", Перечисления.СпособыУстановкиВремениНапоминания.Периодически);
	//			НапоминанияПользователяСлужебный.ПодключитьНапоминание(ПараметрыНапоминания);
	//			

	
	
	
	
КонецПроцедуры

Процедура РешениеПоДокументуПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	         СтандартнаяОбработка=Ложь;
	  		 Задача=Задачи.ЗадачаПривязкаДолжника.СоздатьЗадачу();
			 Задача.БизнесПроцесс=Ссылка;
			 Задача.ТочкаМаршрута=ТочкаМаршрутаБизнесПроцесса;
			 Задача.Дата=ТекущаяДата();
			 Задача.Наименование="БП_Судебная стадия_7777_"+Должник+"_"+Номер;
			 Задача.Отдел=ОтделРабота;
			 Задача.КонтрольнаяДата=Ссылка.ДатаЗавершения;
	         Задача.Записать();
	         ФормируемыеЗадачи.Добавить(Задача);

			 
			 //ОткрытьФорму(
	
	
КонецПроцедуры

Процедура ИсполнительноеПроизводствоПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	  	     СтандартнаяОбработка=Ложь;
	  		 Задача=Задачи.ЗадачаПривязкаДолжника.СоздатьЗадачу();
			 Задача.БизнесПроцесс=Ссылка;
			 Задача.ТочкаМаршрута=ТочкаМаршрутаБизнесПроцесса;
			 Задача.Дата=ТекущаяДата();
			 Задача.Наименование="БП_Исполнительное производство_"+Должник+"_"+Номер;
			 Задача.Отдел=ОтделРабота;
	
	         Задача.Записать();
	         ФормируемыеЗадачи.Добавить(Задача);
			 

		
			 
	
	
КонецПроцедуры

Процедура БанкротствоПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	         СтандартнаяОбработка=Ложь;
	  		 Задача=Задачи.ЗадачаПривязкаДолжника.СоздатьЗадачу();
			 Задача.БизнесПроцесс=Ссылка;
			 Задача.ТочкаМаршрута=ТочкаМаршрутаБизнесПроцесса;
			 Задача.Дата=ТекущаяДата();
			 Задача.Наименование="БП_Банкротство_"+Должник+"_"+Номер;
			 Задача.Отдел=ОтделРабота;
	         Задача.Записать();
	         ФормируемыеЗадачи.Добавить(Задача);
	
КонецПроцедуры

Процедура УмершиеПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	         СтандартнаяОбработка=Ложь;
	  		 Задача=Задачи.ЗадачаПривязкаДолжника.СоздатьЗадачу();
			 Задача.БизнесПроцесс=Ссылка;
			 Задача.ТочкаМаршрута=ТочкаМаршрутаБизнесПроцесса;
			 Задача.Дата=ТекущаяДата();
			 Задача.Наименование="БП_Умершие_"+Должник+"_"+Номер;
			 Задача.Отдел=ОтделРабота;
	         Задача.Записать();
	         ФормируемыеЗадачи.Добавить(Задача);           
	
	
	
КонецПроцедуры

Процедура ЗапросГосударственныхОргановПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
   	         СтандартнаяОбработка=Ложь;
	  		 Задача=Задачи.ЗадачаПривязкаДолжника.СоздатьЗадачу();
			 Задача.БизнесПроцесс=Ссылка;
			 Задача.ТочкаМаршрута=ТочкаМаршрутаБизнесПроцесса;
			 Задача.Дата=ТекущаяДата();
			 Задача.Наименование="БП_Запрос государственных органов_"+Должник+"_"+Номер;
			 Задача.Отдел=ОтделРабота;
	         Задача.Записать();
	         ФормируемыеЗадачи.Добавить(Задача);           
	
	
КонецПроцедуры

Процедура ПретензионнаяРаботаПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	     
	          СтандартнаяОбработка=Ложь;
	  		 Задача=Задачи.ЗадачаПривязкаДолжника.СоздатьЗадачу();
			 Задача.БизнесПроцесс=Ссылка;
			 Задача.ТочкаМаршрута=ТочкаМаршрутаБизнесПроцесса;
			 Задача.Дата=ТекущаяДата();
			 Задача.Наименование="БП_Претензионная работа_"+Должник+"_"+Номер;
			 Задача.Отдел=ОтделРабота;
	         Задача.Записать();
	         ФормируемыеЗадачи.Добавить(Задача);           
	

	
	
	
КонецПроцедуры
